//*****************************************************************************/
//
// 文 件 名：hal_soundvibration.c
//
// 作    者：yizedxl
//
// 创建时间：2013.10
//
// 修改时间：2013.11.26
//
// IAR 版本：IAR for 8051 V8.10.1
//
// 测试平台：Sensor Battery MotherBoard V2.0
//
// 说    明：声音振动检测模块，振动模块连接的是P1_1，声音模块连接的是P1_2。
//           两个模块均是在IO检测到低电平时表示有声音或者是振动出现。
//
//*****************************************************************************/

#include <iocc2530.h>
#include "hal_defs.h"
#include "hal_types.h"

//*****************************************************************************/
//
//函数名：HalSoundVbInit
//
//功  能：声音震动模块IO初始化
//
//参  数：无
//
//返回值：无
//
//*****************************************************************************/
void HalSoundVbInit()
{
    P1DIR &= ~(BV(1) + BV(2));
}

//*****************************************************************************/
//
//函数名：HalSoundCheck
//
//功  能：检测连接声音模块的IO电平
//
//参  数：无
//
//返回值：0-没有声音；
//        1-有声音；
//
//*****************************************************************************/
uint8 HalSoundCheck()
{
    if (P1_2)
    {
        return 0;
    }
    else 
    {
        return 1;
    }
}

//*****************************************************************************/
//
//函数名：HalVibrationCheck
//
//功  能：检测连接振动模块的IO电平
//
//参  数：无
//
//返回值：0-没有振动
//        1-有振动
//
//*****************************************************************************/
uint8 HalVibrationCheck()
{
    if (P1_1)
    {
        return 0;
    }
    else 
    {
        return 1;
    }
}